[
    {
        "id": 1,
        "title": "Web Developer at Digital Logic",
        "duration": "Jun 2021 - Present",
        "roles": [
            "Converting intricate Adobe XD and Figma designs with complex animations into clickable prototypes. We use WordPress CMS as our main website platform tool and Oxygen Page Builder as our primary page builder.",
            "Create custom plugins for certain functionalities. Oxygen Page Builder is not a theme-based plugin, that is why we are required to create such custom functionalities by creating a custom plugin/hooks.",
            "Following the right way of extending and overriding plugin functionalities, by writing the right hooks and actions; To follow WordPress coding structure."
        ]
    },
    {
        "id": 2,
        "title": "Lead Web Developer at Canadian Web Designs",
        "duration": "Sep 2020 - Jan 2021 · 5 mos",
        "roles": [
            "Led a group of CMS web designers/developers, Helping them with their projects. Help manage a team and assign projects to them.",
            "Met up with clients to discuss project requirements and goals. Handling client relations and communications. Prepare business and technical documentation, and also provide technical support to clients.",
            "Assist and collaborate with other developers on technical matters. Conduct security reviews of websites created by co-developers.",
            "Server & Database Management. To strictly monitor uptime, hosting, & databases; ensure the websites are performing at maximum capacity & efficiently."
        ]
    },
    {
        "id": 3,
        "title": "Junior Web Developer at Canadian Web Designs",
        "duration":"May 2020 - Sep 2020 · 5 mos",
        "roles": [
            "Prepare website design proposals to be presented to the clients. We use Photoshop for creating the website prototypes.",
            "Create a user guide or documentation for clients to understand how their website and its features work.",
            "Creating custom functionalities for custom requests from clients. Properly extending a plugin’s hook or creating a custom one via themed-base WordPress development.",
            "Implementation and maintenance of CMS websites (primarily WordPress & Drupal). From installation, development, and documentation to deploying the websites on the web.",
            "Handle website migrations and maintenance from one server to another."
        ]
    },
    {
        "id": 4,
        "title": "Freelance Web Developer at Upwork",
        "duration": "Mar 2020 - Jul 2020 · 5 mos",
        "roles": [
            "WordPress Support proficient with Page Builders (DIVI, Elementor & Beaver Builder).",
            "Creating commission-based websites, designing the prototypes and converting those into a WordPress CMS-based website. Website migration and maintenance are also on my plate.",
            "Optimizing websites and applying SEO standards on client’s websites."
        ]
    },
    {
        "id": 5,
        "title": "Magento & WordPress CMS Developer at iFormatLogic",
        "duration": "Jul 2018 - Jan 2020 · 1 yr 7 mos",
        "roles": [
            "Build and Maintain websites using CMS like WordPress & Magento (ver 1 & 2).",
            "Following the proper way of implementing custom features and functionalities on WordPress based on client’s requirements. Custom Post Types, Custom Fields etc.",
            "Maintaining a Magento 1 E commerce website created in Magento 1 platform. Properly creating mini custom extensions on the store is one of my errands.",
            "Collaborated with other teams on migrating a Magento 1 website into a Magento 2 website. Properly re-creating custom functionalities from Magento 1 version, into Magento 2. Both Magento versions are using PHP MVC Zend Framework."
        ]
    },
    {
        "id": 6,
        "title": "Internship at MoreFun.ph",
        "duration": "Sep 2017 - Dec 2017 · 4 mos",
        "roles": [
            "Received training in WordPress codex, basic web API’s & introduction to PHP.",
            "Received training in introduction to Codeigniter (A PHP MVC Framework).",
            "Conducted manual testing on CMS based websites. Website Forms, Email Forwarding, Security etc.",
            "Others - Data Entry/Content Creation (i.e blog posts)."
        ]
    }
]